RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_usart.h
/**
 *******************************************************************************
 * @file  hc32f4a0_usart.h
 * @brief This file contains all the functions prototypes of the USART(Universal
 *        Synchronous/Asynchronous Receiver Transmitter) driver library.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Hongjh          First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */
#ifndef __HC32F4A0_USART_H__
#define __HC32F4A0_USART_H__

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C"
{
#endif

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_common.h"
#include "ddl_config.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @addtogroup DDL_USART
 * @{
 */

#if (DDL_USART_ENABLE == DDL_ON)

/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup USART_Global_Types USART Global Types
 * @{
 */

/**
 * @brief UART mode initialization structure definition
 */
typedef struct
{
    uint32_t u32Baudrate;               /*!< UART baudrate. The baudrate is valid when clock source is PCLK. */

    uint32_t u32ClkMode;                /*!< Clock mode.
                                             This parameter can be a value of @ref USART_Clock_Mode */

    uint32_t u32PclkDiv;                /*!< PCLK division. The PCLK division function is valid when clock source is PCLK.
                                             This parameter can be a value of @ref USART_PCLK_Division */

    uint32_t u32Parity;                 /*!< Parity format.
                                             This parameter can be a value of @ref USART_Parity_Control */

    uint32_t u32DataWidth;              /*!< Data width.
                                             This parameter can be a value of @ref USART_Data_Length_Bits */

    uint32_t u32StopBit;                /*!< Stop Bits.
                                             This parameter can be a value of @ref USART_Stop_Bits */

    uint32_t u32OversamplingBits;       /*!< Oversampling Bits.
                                             This parameter can be a value of @ref USART_Oversampling_Bits */

    uint32_t u32BitDirection;           /*!< Significant bit.
                                             This parameter can be a value of @ref USART_Significant_Bit */

    uint32_t u32NoiseFilterState;       /*!< RX pin noise filter state.
                                             This parameter can be a value of @ref USART_Noise_Filter_State */

    uint32_t u32SbDetectPolarity;       /*!< Start Bit Detect Polarity.
                                             This parameter can be a value of @ref USART_Start_Bit_Detect_Polarity */

    uint32_t u32HwFlowCtrl;             /*!< Hardware flow control.
                                             This parameter can be a value of @ref USART_Hardware_Flow_Control */
} stc_usart_uart_init_t;

/**
 * @brief UART multiple-processor initialization structure definition
 */
typedef struct
{
    uint32_t u32Baudrate;               /*!< UART baudrate. The baudrate is valid when clock source is PCLK. */

    uint32_t u32ClkMode;                /*!< Clock mode.
                                             This parameter can be a value of @ref USART_Clock_Mode */

    uint32_t u32PclkDiv;                /*!< PCLK division. The PCLK division function is valid when clock source is PCLK.
                                             This parameter can be a value of @ref USART_PCLK_Division */

    uint32_t u32DataWidth;              /*!< Data width.
                                             This parameter can be a value of @ref USART_Data_Length_Bits */

    uint32_t u32StopBit;                /*!< Stop Bits.
                                             This parameter can be a value of @ref USART_Stop_Bits */

    uint32_t u32OversamplingBits;       /*!< Oversampling Bits.
                                             This parameter can be a value of @ref USART_Oversampling_Bits */

    uint32_t u32BitDirection;           /*!< Significant bit.
                                             This parameter can be a value of @ref USART_Significant_Bit */

    uint32_t u32NoiseFilterState;       /*!< RX pin noise filter state.
                                             This parameter can be a value of @ref USART_Noise_Filter_State */

    uint32_t u32SbDetectPolarity;       /*!< Start Bit Detect Polarity.
                                             This parameter can be a value of @ref USART_Start_Bit_Detect_Polarity */

    uint32_t u32HwFlowCtrl;             /*!< Hardware flow control.
                                             This parameter can be a value of @ref USART_Hardware_Flow_Control */
} stc_usart_multiprocessor_init_t;

/**
 * @brief LIN mode initialization structure definition
 */
typedef struct
{
    uint32_t u32Baudrate;               /*!< UART baudrate. The baudrate is valid when clock source is PCLK. */

    uint32_t u32ClkMode;                /*!< Clock mode.
                                             This parameter can be a value of @ref USART_Clock_Mode */

    uint32_t u32PclkDiv;                /*!< PCLK division. The PCLK division function is valid when clock source is PCLK.
                                             This parameter can be a value of @ref USART_PCLK_Division */

